# FileVersion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExportOptions..::..FileVersion Property
IFCExportOptions Class See Also
---
IFC file version.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public IFCVersion FileVersion { get; set; }
```

Visual Basic
---
```text
Public Property FileVersion As IFCVersion
	Get
	Set
```

Visual C++
---
```text
public:
property IFCVersion FileVersion {
	IFCVersion get ();
	void set (IFCVersion value);
}
```

# Remarks
Default is IFCVersion.Default.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace